# -*- coding: utf-8 -*-
"""Summary_9_111124.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1Wr4BfqLBqgvk_9U39KCe_tJglXnOqhNR

## Python fundamentals: Домашнее задание 17 (Python)

### 1.
Напишите программу, которая принимает список чисел от пользователя и передает его в функцию modify_list,
которая изменяет элементы списка.
Функция должна умножить нечетные числа на 2, а четные числа разделить на 2.
Выведите измененный список на экран. Объясните, почему изменения происходят только внутри функции и как работают изменяемые и неизменяемые параметры.


Пример вывода:


Введите список чисел, разделенных пробелами: 1 2 3 4 5

Измененный список чисел: [2, 1, 6, 2, 10]
"""

# extra
def modify_list(numbers):
    for i, elem in enumerate(numbers):
        if elem % 2 == 0:
            result = elem // 2
        else:
            result = elem * 2
        numbers[i] = result

num_list = [1, 2, 3, 4, 5]
# print(list(enumerate(num_list)))
modify_list(num_list)
print(f'Измененный список чисел: {num_list}')

# Вариант 1:
modify_list = [int(a)*2 if int(a)%2 != 0 else round(int(a)/2) for a in input("Введите числа через пробел: ").split(" ")]
print("Измененный список чисел:",modify_list)

# Вариант 2:
your_number = [1, 2, 3, 4, 5]
# your_number = list(map(int, str(input("Введите числа через пробел: ")).split()))
modify_list = [a*2 if a%2 != 0 else round(a/2) for a in your_number]
print("Измененный список чисел:", modify_list)

# Вариант 3:
your_number = [1, 2, 3, 4, 5]
def add(*your_number):
  new_number = []
  for number in your_number:
    if number % 2 == 0:
      result = number // 2
    else:
      result = number * 2

    new_number.append(result)
  return new_number

print(your_number)
print("Измененный список чисел:", add(*your_number))

# Функция должна умножить нечетные числа на 2, а четные числа разделить на 2. Выведите измененный список на экран.
# 1 2 3 4 5 6

master_list = input('Enter numbers separated by spaces: ').split()

while True:
    if all(item.isnumeric() for item in master_list):
        break
    else:
        print('Not a number. Please input only numbers:')
        master_list = input('Enter numbers separated by spaces: ').split()


def modify_list(*master_list):
    return [int(x) *2 if int(x) % 2 != 0 else int(x) // 2 for x in master_list]


print(f'Muliplication odds by 2 and deviding even numbers by 2: {modify_list(*master_list)}')

def modify_list(numbers_list, condition):
    new_list = [number // 2 if condition(number) else number * 2 for number in numbers_list]
    return new_list
print(modify_list(([1, 2, 3, 4, 5]), lambda x: x % 2 == 0))

def modify_lis(*args):
    res_list = []
    for elem in args:
        if elem % 2 == 0:
            res_list.append(elem//2)
        else:
            res_list.append(elem*2)
    return res_list

user_numbers = input('Введите список чисел, разделенных пробелами:')
num_list = [int(item) for item in user_numbers.split()]
print(f'Измененный список чисел: {modify_lis(*num_list)}')

def modify_list(numbers):
    num = [ round(number / 2) if number % 2 == 0 else number * 2 for number in numbers ]
    return num


l_numbers = list(map(int, input("Введите список чисел, разделенных пробелами: ").split()))
print(modify_list(l_numbers))

# или:
def modify_list():
    l_numbers = input('Введите список чисел, разделенных пробелами: ').split()
    num = [ round(int(number) / 2) if int(number) % 2 == 0 else int(number) * 2 for number in l_numbers ]
    return num


print(modify_list())

def modify_list(numbers):
    result = [int(num) // 2 if int(num) % 2 == 0 else int(num) * 2 for num in numbers]
    # result = []
    # for num in numbers:
    #     if int(num) % 2 == 0:
    #         result.append(int(num) // 2)
    #     else:
    #         result.append(int(num) * 2)
    return result
list_numbers = input("Введите список чисел, разделенных пробелами: ").split()

print(f'Измененный список чисел: {modify_list(list_numbers)}')

print('Задание №1\n')
user_input = input('Введите числа, разделённые пробелами: ').split(" ")
user_input = [int(x) for x in user_input]
print(f'Введённые числа: {user_input}')
user_output = [] # создание нового выводного списка
def modify_list(urlist):
    for x in urlist:
        if x % 2 == 0:
            x //= 2
            user_output.append(x)
        elif x % 2 != 0:
            x *= 2
            user_output.append(x)
modify_list(user_input)
print(f'\nИзменённый список чисел: {user_output}')

print(f'\n\nВторой вариант решения задания\n')
modified_list = [int(x) * 2 if int(x) % 2 != 0 else int(x) // 2 for x in input(f'Введите числа через пробел: ').split(" ")]
print(f'Изменённый список чисел: {modified_list}')

def modify_list(num_list):
    modified_list = [num * 2 if num % 2 != 0 else round(num / 2) for num in num_list]
    return modified_list


user_list = [num for num in range(1, 6)] #automatic input
# user_list = list(map(int, input("Enter numbers: ").split())) #user input
print(modify_list(user_list))

def modify_list(numbers):
    numbers = [int(num) // 2 if int(num) % 2 == 0 else int(num) * 2 for num in numbers]
    return numbers
list_numbers = input("Введите список чисел, разделенных пробелами: ").split()

print(f'Измененный список чисел: {modify_list(list_numbers)}')

print(list_numbers)

"""### 2.
Напишите программу, которая принимает произвольное количество аргументов от пользователя 
и передает их в функцию calculate_sum, которая возвращает сумму всех аргументов. 
Используйте оператор * при передаче аргументов в функцию. Выведите результат на экран.


Пример вывода:


Введите числа, разделенные пробелами: 1 2 3 4 5

Сумма чисел: 15
"""

your_number = [1, 2, 3, 4, 5]
# your_number = input("Введите числа через пробел: ")
# your_number = [int(x) for x in your_number.split()]
calculate_sum = lambda *your_number: sum(your_number)

print("Сумма чисел:",calculate_sum(*your_number))

main_list = input('Enter a numbers separated by space: ').split()
while True:
    if all(item.isnumeric() for item in main_list):
        break
    else:
        print('Wrong input. Please enter only numbers')
        main_list = input('Enter a numbers separated by space: ').split()


def calculate_sum(*args):
    numbers = [int(arg) for arg in args]
    return sum(numbers)

result = calculate_sum(*main_list)
print(f'The sum of entered numbers is: {calculate_sum(result)}')

def calculate_sum(*args):
    sum_list = sum(number for number in args)
    return sum_list
print(calculate_sum(*map(int, input("Введите числа, разделенные пробелами: ").split())))

def calculate_sum(*args):
    res = 0
    for item in args:
        res += item
    return res


num = input('Введите числа, разделенные пробелами: ')
num_list = [int(elem) for elem in num.split()]

print(f'Сумма чисел: {calculate_sum(*num_list)}')

# 1
def calculate_sum(*args):
    i = 0
    for arg in args:
        for a in arg:
            i += int(a)
    return i

l_numbers = input("Введите список чисел, разделенных пробелами: ").split()
print(calculate_sum(l_numbers))

# 2
def calculate_sum(*args):
    s = [ a for arg in args for a in arg ]
    return sum(s)

l_numbers = list(map(int, input("Введите список чисел, разделенных пробелами: ").split()))
print(calculate_sum(l_numbers))

# 3
def calculate_sum(*args):
    s = [ int(a) for arg in args for a in arg ]
    return sum(s)

l_numbers = calculate_sum(input("Введите список чисел, разделенных пробелами: ").split())
print(l_numbers)

def calculate_sum(*numbers):
    # result = [int(num) for row in numbers for num in row]
    result = []
    for row in numbers:
        for num in row:
            result.append(int(num))

    sum_result = sum(result)
    return sum_result

numbers = input("Введите числа, разделенные пробелами: ").split()

sum_numers = calculate_sum(numbers)
print(f'Сумма чисел: {sum_numers}')

print('\n\nЗадание №2\n')
def calculate_sum(*x):
    return print(f'Сумма введённых чисел: {sum(*x)}')
user_input = [int(x) for x in input(f'Введите числа, разделённые пробелом: ').split(" ")]
calculate_sum(user_input)


print(f'\n\nВторой вариант решения задания\n')
calculate_sum = lambda *x: sum(x)
user_input = [int(x) for x in input(f'Введите числа, разделённые пробелом: ').split(" ")]
print(f'Сумма введённых чисел: {calculate_sum(*user_input)}')

def calculate_sum(*args):
    return sum(args)


# user_nums = input("Enter numbers, separated by ' ': ") #user_input
user_nums = "1 2 3 4 5" #automatic input
num_list = [int(item) for item in user_nums.split()]

print(f"The total sum is: {calculate_sum(*num_list)}")

"""## Python fundamentals: Домашнее задание 18 (Python)

### 1.
Написать программу, вычисляющую факториал числа.

Решить задачу с помощью рекурсии.
"""

# 1
num2fact = 5
fact_steps = []
direction = ' winding '

def get_fancy_factorial(i, fact = 1, result = 1, iter_info = 0):
    if i <= 0:
        print('-' * (iter_info // 2 - (len(direction)//2)) + direction + '-' * (iter_info // 2 - (len(direction)//2)))
        return result

    else:
        fact_steps.append(fact)
        iter_info = f'iter {i}: {i} * {result} = {i * result}'
        print(iter_info)

        return get_fancy_factorial(i - 1, fact + 1, i * result, len(iter_info)) # Start returning from here


result = get_fancy_factorial(num2fact)
[
    print(str(num2fact)+ '! = ' + str(x) + '*', end = '') if fact_steps.index(x) == 0 else
    print(f'{str(x)} = {result}') if fact_steps.index(x) == num2fact - 1 else
    print(str(x) + '*', end = '') for x in fact_steps
]


print('\n--------------------------------------------------------\n')
fact_steps_1 = []
direction = ' unwinding '

def get_fancy_factorial_1(i):
    if i <= 1:
        print(f'iter {i}: {i} * {i} = {i * i}')
        fact_steps_1.append(i)
        return 1 # Start returning from here


    partial_result = get_fancy_factorial_1(i - 1)
    result = i * partial_result
    iter_info = f'iter {i}: {i} * {partial_result} = {result}'
    fact_steps_1.append(i)

    print(iter_info)
    print('-' * (len(iter_info) // 2 - (len(direction)//2)) + direction + '-' * (len(iter_info) // 2 - (len(direction)//2))) if i == num2fact else None

    return result


result = get_fancy_factorial_1(num2fact)
fact_steps_1rev = fact_steps_1[:]
fact_steps_1rev.reverse()

[
    print(str(num2fact)+ '! = ' + str(x) + '*', end='') if x == fact_steps_1rev[0] else
    print(f'{str(x)} = {result}') if x == fact_steps_1rev[-1] else
    print(str(x) + '*', end='') for x in fact_steps_1rev
]

print('\n--------------------------------------------------------\n')

def get_boring_factorial(fa):
    if fa <= 1:
        return 1
    else:
        return fa * get_boring_factorial(fa - 1)

def factorial(n):
    if n < 0:
        return None
    if n == 0:
        return 1
    else:
        return n * factorial(n - 1)

# Ввод числа
num = int(input("Введите число: "))
print(f"Факториал {num} равен {factorial(num)}")

"""


### 2.
Напишите программу, которая использует рекурсию для вычисления суммы цифр числа. 
Создайте функцию sum_digits, которая принимает один аргумент - число, для которого нужно вычислить сумму цифр. 
Используйте условие выхода из рекурсии, когда число состоит из одной цифры. Выведите результат на экран.


Пример вывода:


Введите число: 12345

Сумма цифр числа 12345 равна 15

"""

input_num = 123456
summ = 0

def sum_digits(dig):
    global summ

    if dig == None:
        return summ

    dig = str(dig)
    int_len = len(dig)
    summ += int(dig[0])
    dig = dig[1:int_len] if len(dig) > 1 else None
    return sum_digits(dig)

result = sum_digits(input_num)

print(f'sum of each number in "{input_num}" is: {result}')

def sum_digits(n):
    if n < 10:
        return n
    return n % 10 + sum_digits(n // 10)

num = int(input("Введите число: "))
print(f"Сумма цифр числа {num} равна {sum_digits(num)}")